samples/ITI-44_request_raw.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope">
  <env:Header>
    <wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">
   https://epd-test.ith-icoserve.com:7443/PIXPDQ/services/PIXPDQV3ManagerService
    </wsa:To>
    <wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">urn:uuid:c12e1f14-c2c9-4a94-ba27-6511e8c90b78</wsa:MessageID>
    <wsa:ReplyTo xmlns:wsa="http://www.w3.org/2005/08/addressing">
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
    </wsa:ReplyTo>
    <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing" env:mustUnderstand="1">urn:hl7-org:v3:PRPA_IN201301UV02</wsa:Action>
  </env:Header>
  <env:Body>
    <PRPA_IN201301UV02 xmlns="urn:hl7-org:v3" ITSVersion="XML_1.0">
      <id extension="1694431245655" root="1.3.6.1.4.1.21367.2017.2.7.141"/>
      <creationTime value="20230911115902"/>
      <interactionId extension="PRPA_IN201301UV02" root="2.16.840.1.113883.1.6"/>
      <processingCode code="T"/>
      <processingModeCode code="T"/>
      <acceptAckCode code="AL"/>
      <receiver typeCode="RCV">
        <device classCode="DEV" determinerCode="INSTANCE">
          <id root="1.3.6.1.4.1.21367.2017.2.4.136"/>
        </device>
      </receiver>
      <sender typeCode="SND">
        <device classCode="DEV" determinerCode="INSTANCE">
          <id root="1.3.6.1.4.1.21367.2017.2.2.140"/>
        </device>
      </sender>
      <controlActProcess classCode="CACT" moodCode="EVN">
        <code code="PRPA_TE201301UV02" codeSystem="2.16.840.1.113883.1.6"/>
        <subject contextConductionInd="false" typeCode="SUBJ">
          <registrationEvent classCode="REG" moodCode="EVN">
            <statusCode code="active"/>
            <subject1 typeCode="SBJ">
              <patient classCode="PAT">
                <id assigningAuthorityName="MyPrimarySystem" extension="TestSystemId" root="1.3.6.1.4.1.21367.2017.2.5.89"/>
                <id assigningAuthorityName="ZAS" extension="761337610435201235" root="2.16.756.5.30.1.127.3.10.3"/>
                <statusCode code="active"/>
                <patientPerson classCode="PSN" determinerCode="INSTANCE">
                  <name>
                    <family>Muster</family>
                    <given>Maja</given>
                  </name>
                  <name>
                    <family qualifier="BR">Tauxe</family>
                    <given>Maja</given>
                  </name>
                  <administrativeGenderCode code="F" codeSystem="2.16.840.1.113883.12.1" displayName="Female"/>
                  <birthTime value="19600618"/>
                  <addr>
                    <city>Wettingen</city>
                    <country>CH</country>
                    <postalCode>5430</postalCode>
                    <streetAddressLine>Imfeldstrasse 24b</streetAddressLine>
                  </addr>
                </patientPerson>
                <providerOrganization classCode="ORG" determinerCode="INSTANCE">
                  <id root="1.3.6.1.4.1.21367.2017.2.5.89"/>
                  <id root="2.16.756.5.30.1.127.3.10.3"/>
                  <name>MyCompany</name>
                  <contactParty classCode="CON">
                    <contactPerson classCode="PSN" determinerCode="INSTANCE">
                      <name xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="PN">
                        <family>Administrator</family>
                        <given>Max</given>
                      </name>
                    </contactPerson>
                  </contactParty>
                </providerOrganization>
              </patient>
            </subject1>
            <custodian typeCode="CST">
              <assignedEntity classCode="ASSIGNED">
                <id root="1.3.6.1.4.1.21367.2017.2.5.108"/>
                <assignedOrganization classCode="ORG" determinerCode="INSTANCE">
                  <name xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ON">MyCompany</name>
                </assignedOrganization>
              </assignedEntity>
            </custodian>
          </registrationEvent>
        </subject>
      </controlActProcess>
    </PRPA_IN201301UV02>
  </env:Body>
</env:Envelope>
